Tekla.Structures.Model.Internal.ReportingExcelDialogCallbackClient
Excel report callback client.

Tekla.Structures.Model.Internal.ReportingExcelDialogCallbackClient.#ctor(Tekla.Structures.Model.Internal.ReportingExcelDialogDelegate)
Creates a new instance of the Tekla.Structures.Model.Internal.ReportingExcelDialogCallbackClient class.
callback: The delegate to call when the Excel report dialog needs to be opened.

Tekla.Structures.Model.Internal.ReportingExcelDialogCallbackClient.OpenReportingExcelDialog(Tekla.Structures.Model.Internal.ExcelReportData@)
